zhanzr/XMC1100-Boot-Kit-Demo/main.c
#define ClassB_FLASH_SIZE 0x00032000
#define ClassB_FLASH_START 0x10001000
#define ClassB_TEST_POST_FLASH_ECC 1
#define ClassB_TEST_POST_FLASH_ECC_PAGE 0x10010000
#define SIZE2K                          ((uint32_t) 0x00000500)  /*!< definition for 2k area */
#define SIZE4K                          ((uint32_t) 0x00001000)  /*!< definition for 4k area */
#define SIZE8K                          ((uint32_t) 0x00002000)  /*!< definition for 8k area */
#define SIZE16K                         ((uint32_t) 0x00004000)  /*!< definition for 16k area */
#define SIZE32K                         ((uint32_t) 0x00008000)  /*!< definition for 32k area */
#define SIZE64K                         ((uint32_t) 0x00010000)  /*!< definition for 64k area */
#define SIZE128K                        ((uint32_t) 0x00020000)  /*!< definition for 128k area */
#define SIZE256K                        ((uint32_t) 0x00040000)  /*!< definition for 256k area */

/** ECC pattern uses 4 blocks:
*   1. Block to verify the content is available (2 DWords)
*   2. Block no errors                          (8 DWords)
*   3. Block to verify single bit correction    (10 DWords)
*   4. Block to verify double bit detection     (14 DWord)
*   orignal pattern from ECC Test on Infineon TriCore devices
*/
static const FLASH_StructEccPageType FLASH_ECC_pattern =
{
    .ExpOkay = 57U,                                        /* expected okay patterns     */
    .ExpSingleBitErr = 6U,                                         /* expected single bit errors */
    .ExpDoubleBitErr = 14U,                                        /* expected double bit errors */
    .LimitToSBErr = 10U,                                        /* words without double-Bit errors */
    .ExpLinitSBErr = 3U,                                         /* expected single bite errors in the initial word */
    .WRInitValue_high = 0xA15E3F09U, .WRInitValue_low = 0x83D5A9C3U,                   /* initial first write value  */
                                                /* Error Msk                       */
    .PageData = 
		{   /* second write values     expected readback values:      Nr  rd  nok SB DB */
        {0xFFFFFFFFU, 0xFFFFFFFFU, 0xA15E3F09U, 0x83D5A9C3U }, /* #1,  2,  0, 0, 0 */
        {0xFFFFFFFFU, 0xFFFFFFFFU, 0xA15E3F09U, 0x83D5A9C3U }, /* #2,  4,  0, 0, 0 */

        {0xA1FFFFFFU, 0xFFFFFFFFU, 0x215E3F09U, 0x83D5A9C1U }, /* #3,  5,  2, 1, 0 */
        {0x41FBFFFFU, 0xFFFFFFFFU, 0x015A3F09U, 0x83D5A9C1U }, /* #4,  5,  3, 1, 0 */
        {0xC7FFFFFFU, 0xFFFFFFFFU, 0x815E3F09U, 0x83D5A9C1U }, /* #5,  6,  4, 1, 0 */
        {0xBFFFFFFFU, 0x7FFFFFFFU, 0xA11E3F09U, 0x03D5A9C3U }, /* #6,  8,  4, 2, 0 */
        {0x487FFFFFU, 0xFFFFFFFFU, 0x005E3F09U, 0x83D5A9C1U }, /* #7,  9,  4, 2, 0 */
        {0xFFFFFFFFU, 0xFFFFFF7FU, 0xA15E3F09U, 0x83D5A945U }, /* #8,  10, 6, 2, 0 */
        {0x137694A0U, 0x60775400U, 0x01561400U, 0x00550400U }, /* #9,  12, 6, 3, 0 */
        {0xFEFFFF9FU, 0xFFFFFFFFU, 0xA05E3F08U, 0x83D5A9C3U }, /* #10, 13, 7, 3, 0 */
        {0x1FF9FE00U, 0x2D7215A0U, 0x01583E00U, 0x01500180U }, /* #11, 15, 7, 3, 1 */
        {0xFFBFFFFCU, 0xBFFFFFFFU, 0xA11E3F08U, 0x83D5A9C3U }, /* #12, 17, 7, 3, 3 */
        {0x77B28F2CU, 0x4A1251B5U, 0x21120F28U, 0x02100181U }, /* #13, 19, 7, 4, 3 */
        {0xFEA92400U, 0x07FFFFFFU, 0xA0082400U, 0x03D5A9C3U }, /* #14, 21, 7, 4, 3 */
        {0xFBD7FFFFU, 0xFFFFFFFFU, 0xA1563F09U, 0x83D5A9C3U }, /* #15, 23, 7, 4, 3 */
        {0xFFE4FFFFU, 0xFFFFFFFFU, 0xA1443F89U, 0x83D5A9C3U }, /* #16, 25, 7, 5, 3 */
        {0xFFFC3FFFU, 0xFFFFFFFFU, 0xA15C3F09U, 0x83D5A9C3U }, /* #17, 27, 7, 5, 4 */
        {0xEA9BFFFFU, 0xFFFFFFFFU, 0xA01A3F09U, 0x83D5A9C3U }, /* #18, 29, 7, 5, 5 */
        {0xFFFEDCFFU, 0xDFFFF01FU, 0xA15E1C09U, 0x83D5A003U }, /* #19, 31, 7, 5, 6 */
        {0xE0D3FC0DU, 0xB0FFFFFFU, 0xA0523C09U, 0x80D5A9C3U }, /* #20, 33, 7, 5, 7 */
        {0xFFBF7FFFU, 0xFFFFFFFFU, 0xA11E3F09U, 0x83D5A9C3U }, /* #21, 35, 7, 5, 8 */
        {0xEB8BFFFFU, 0xFFFFFFFFU, 0xA10A3F09U, 0x83D5A9C3U }, /* #22, 37, 7, 5, 9 */
        {0xFFEE467FU, 0xFFFFFFFFU, 0xA14E0609U, 0x83D5A9C3U }, /* #23, 39, 7, 5, 10 */
        {0xFFFE47BFU, 0xFFFFFFFFU, 0xA15E0709U, 0x83D5A9C3U }, /* #24, 41, 7, 5, 11 */
        {0xFFEE7E7FU, 0xFFFFFFFFU, 0xA14E3E09U, 0x83D5A9C3U }, /* #25, 43, 7, 5, 12 */
        {0xFFFE67F0U, 0x3FFFFFFFU, 0xA15E2700U, 0x03D5A9C3U }, /* #26, 45, 7, 5, 13 */
        {0xFFF7F7FFU, 0xFFFFFFFFU, 0xA1563709U, 0x83D5A9C3U }, /* #27, 47, 7, 5, 13 */
        {0xF6F7C0BFU, 0xFFFFFFFFU, 0xA0560009U, 0x83D5A9C3U }, /* #28, 49, 7, 5, 13 */
        {0xF6D7FFBFU, 0xFFFFFFFFU, 0xA2563F09U, 0x83D5A9C3U }, /* #29, 51, 7, 6, 13 */
        {0xEFE37FDDU, 0xFFFFFFFFU, 0xA1423F09U, 0x83D5A9C3U }, /* #30, 53, 7, 6, 13 */
        {0xF6C7FFFFU, 0xFFFFFFFFU, 0xA0463F09U, 0x83D5A9C3U }, /* #31, 55, 7, 6, 13 */
        {0xFEB77FFFU, 0xFFFFFFFFU, 0xA0163F09U, 0x83D5A9C3U }, /* #32, 57, 7, 6, 14 */
    }
};

static ClassB_EnumTestResultType ClassB_FLASHECC_VerifyPage(void)
{
#ifdef TESSY
	#undef	ClassB_TEST_POST_FLASH_ECC_PAGE
	#define ClassB_TEST_POST_FLASH_ECC_PAGE	(unsigned long)TS_ClassB_TEST_POST_FLASH_ECC_PAGE
#endif
    /*lint -save -e923 -e946 MISRA Rule 11.4, 17.2 accepted */
    register uint32_t* DataPtr = (uint32_t*)(ClassB_TEST_POST_FLASH_ECC_PAGE);
    /*lint -restore */
    return ((FLASH_ECC_pattern.WRInitValue_low  == DataPtr[FIRST_ARRAY_ELEMENT]) &&
            (FLASH_ECC_pattern.WRInitValue_high == DataPtr[SECOND_ARRAY_ELEMENT]))
            ?  ClassB_testPassed : ClassB_testFailed;
}


__sectionClassB__
/*! @endcond */
static ClassB_EnumTestResultType ClassB_FLASHECC_ClearStatus(void)
{
    ClassB_EnumTestResultType Result = ClassB_testFailed;

    /* Input parameter check */
    if ((NVM != Null) && (SCU_INTERRUPT != Null))
    {
        /* clear error status*/
        /* reset ECC2READ,ECC1READ in NVMSTATUS */
        SET_BIT(NVM->NVMPROG, NVM_NVMPROG_RSTECC_Pos);
        /* reset Write protocol error in NVMSTATUS */
        SET_BIT(NVM->NVMPROG, NVM_NVMPROG_RSTVERR_Pos);
        /* clear Write protection in NVMSTATUS */
        SET_BIT(NVM->NVMPROG, NVM_NVMSTATUS_WRPERR_Pos);
        /* clear Verification Error in NVMSTATUS */
        SET_BIT(NVM->NVMPROG, NVM_NVMPROG_RSTVERR_Pos);
        /*lint -save -e923 MISRA Rule 11.1, 11.3 accepted */
        /** clear interrupts */
        SET_BIT(SCU_INTERRUPT->SRCLR, SCU_INTERRUPT_SRCLR_FLECC2I_Pos);

