zhanzr/XMC1100-Boot-Kit-Demo/main.c
        Result = ClassB_testPassed;
    }
    else
    {
        Result = ClassB_testFailed;
    }
    /*lint -restore */
    return(Result);
}

__sectionClassB__
/*! @endcond */
static ClassB_EnumTestResultType ClassB_FLASHECC_ReadPage(uint8_t* CoutDBErr, FLASH_EnumEccTestModeType TestMode)
{
    uint32_t*                 lAddress;
    uint32_t                  readback  = 0u;
    uint32_t                  ECC_Index = 0u;
    const                     FLASH_StructEccWordType* ECC_Word;
    uint16_t*                 FlashStatus;
    ClassB_EnumTestResultType result = ClassB_testPassed;
    uint32_t                  lCount;
    uint8_t                   lCntOK    = 0u;
    uint8_t                   lCntSBErr = 0u;

    if ((NVM != Null) && (CoutDBErr != Null))
    {
        /* reset values */
        *CoutDBErr = 0u;
        /*lint -save -e923 -e929 MISRA Rule 11.1, 11.4 accepted */
        FlashStatus = (uint16_t*)&NVM->NVMSTATUS;
        lAddress    = (uint32_t*)ClassB_TEST_POST_FLASH_ECC_PAGE;
        lCount      = ((FLASH_PAGE_SIZE/FLASH_WORD_SIZE)/2u);
        /* limit the read numbers to non double-bit error reads */
        if (TestMode == FLASH_ECC_TestMode_Reduced)
        {
            lCount  = (uint32_t)FLASH_ECC_pattern.LimitToSBErr;
        }
        else
        {
            /** Do nothing */
        }

        /*lint -restore */
        while ((lCount > 0u) && (result == ClassB_testPassed))
        {
            /* Reading the memory:
               will cause a trap if ECC double bit-error is present.
               Double-Bit Error interrupt is disabled so double-Bit errors are
               counted by evaluating the trap flags.
               One double bit error in a 32-Bit word will lead to one traps,
               as we read two 32-Bit values for the single-bit error we just
               look at the status bit after each read and check the proper
               correction by comparing the values
            */
            ECC_Word = &FLASH_ECC_pattern.PageData[ECC_Index];
            ECC_Index++;
            /* read and prepare next address */
            readback = *lAddress;
            lAddress++;
            /* compare */
            if (readback == ECC_Word->data_low_RB)
            {
                lCntOK++;   /* correct data read may be corrected by single bit correction */
            }
            else
            {
                /** Do nothing */
            }

            /* reading and clearing the error status register */
            lCntSBErr  += (*FlashStatus & NVM_NVMSTATUS_ECC1READ_Msk) >> NVM_NVMSTATUS_ECC1READ_Pos;
            *CoutDBErr += (*FlashStatus & NVM_NVMSTATUS_ECC2READ_Msk) >> NVM_NVMSTATUS_ECC2READ_Pos;
            result = ClassB_FLASHECC_ClearStatus();
            if (result == ClassB_testPassed)
            {
                /* read and prepare next address */
                readback = *lAddress;
                lAddress++;
                /* compare */
                if (readback == ECC_Word->data_high_RB)
                {
                    lCntOK++;   /* correct data read may be corrected by single bit correction */
                }
                else
                {
                    /** Do nothing */
                }

                /* reading and clearing the error status register */
                lCntSBErr  += (*FlashStatus & NVM_NVMSTATUS_ECC1READ_Msk) >> NVM_NVMSTATUS_ECC1READ_Pos;
                *CoutDBErr += (*FlashStatus & NVM_NVMSTATUS_ECC2READ_Msk) >> NVM_NVMSTATUS_ECC2READ_Pos;
                result = ClassB_FLASHECC_ClearStatus();
            }
            else
            {
                /** Do nothing */
            }

            lCount--;
        }

        if (result == ClassB_testPassed)
        {
            if (TestMode == FLASH_ECC_TestMode_Reduced)
            {   /* runtime test will not check for double bit errors */
                if (FLASH_ECC_pattern.ExpLinitSBErr != lCntSBErr)
                {
                    result = ClassB_testFailed;
                }
                else
                {
                    /** Do nothing */
                }
            }
            else
            {
                if ((FLASH_ECC_pattern.ExpSingleBitErr != lCntSBErr) || (FLASH_ECC_pattern.ExpOkay != lCntOK))
                {
                    result = ClassB_testFailed;
                }
                else
                {
                    /** Do nothing */
                }
            }
        }
        else
        {
            /** Do nothing */
        }
    }
    else
    {
        result     = ClassB_testFailed;
    }

    return (result);
}

static ClassB_EnumTestResultType ClassB_FLASHECC_ProgramPage(void)
{
    /*lint -save -e923 MISRA 2004 Advisory Rule 11.1 accepted */
    uint32_t                   lContent[FLASH_PAGE_SIZE/FLASH_WORD_SIZE]; /* 256 bytes buffer */
    uint32_t*                  lAddress   = (uint32_t*)ClassB_TEST_POST_FLASH_ECC_PAGE;
    ClassB_EnumTestResultType  result     = ClassB_testPassed;
    FLASH_EnumRomNvmStatusType lstatus;
    uint8_t                    ProtectedSectors;
    uint8_t                    ECCSector;
    uint8_t                    lCount;
    uint8_t                    lSCount;

    if (NVM != Null)
    {
        /* Enabling flash Idle State*/
        NVM->NVMPROG = FLASH_ECCVERRRST_IDLESET;
        /* reset ECC2READ,ECC1READ in NVMSTATUS */
        SET_BIT(NVM->NVMPROG, NVM_NVMPROG_RSTECC_Pos);
        /* reset Write protocol error in NVMSTATUS */
        SET_BIT(NVM->NVMPROG, NVM_NVMPROG_RSTVERR_Pos);

        /* check write protection */
        /* determine actual ECC test sector number */
        ECCSector = ((uint8_t)(ClassB_TEST_POST_FLASH_ECC_PAGE - ClassB_FLASH_START) / SIZE4K);
        /* check number of protected sectors */
        ProtectedSectors = ((uint8_t)(NVM->NVMCONF & NVM_NVMCONF_SECPROT_Msk) >> NVM_NVMCONF_SECPROT_Pos);
        /* check protection size exceeds test space */
        if (ECCSector < ProtectedSectors)
        {
            result = ClassB_testFailed;
        }
        else
        {
            /** Do nothing */
        }

        if (result == ClassB_testPassed)
        {
            /*lint -save -e661 accepted */
            /* prepare data */
            for (lCount = 0u; lCount < ((uint8_t)(FLASH_PAGE_SIZE/sizeof(uint32_t))); lCount+=2)
            {
                lContent[lCount]      = FLASH_ECC_pattern.WRInitValue_low;
                lContent[lCount + 1u] = FLASH_ECC_pattern.WRInitValue_high;
            }
            /*lint -restore */
            /* save the data to Flash */
            /*lint -save -e929 MISRA Rule 11.4 accepted */
            /*lint -e961 MISRA 2004 Advisory Rule Rule 12.13 accepted */
            lstatus = FLASH_ProgVerifyPage((uint32_t*)&lContent[0], lAddress);
            /*lint -restore */

            if (lstatus != FLASH_ROM_PASS)
            {
                result = ClassB_testFailed;
            }
            else    /* Flashing worked perfect and second flash content can be written */
            {
                lContent[4u] = ClassB_TEST_POST_FLASH_ECC_PAGE + FLASH_PAGE_SIZE;
                /* write the secondary data */
                lSCount = 0u;
                do {
                    /* get the data from the struct */
                    lCount = FIRST_ARRAY_ELEMENT;
                    lContent[FIRST_ARRAY_ELEMENT]  = FLASH_ECC_pattern.PageData[lSCount].data_low_SecondWR;
                    lContent[SECOND_ARRAY_ELEMENT] = FLASH_ECC_pattern.PageData[lSCount].data_high_SecondWR;
                    lSCount++;
                    lContent[THIRD_ARRAY_ELEMENT]  = FLASH_ECC_pattern.PageData[lSCount].data_low_SecondWR;
                    lContent[FOURTH_ARRAY_ELEMENT] = FLASH_ECC_pattern.PageData[lSCount].data_high_SecondWR;
                    lSCount++;

                    /* commit the write to the flash module */
                    NVM->NVMPROG = ((NVM_NVMPROG_RSTECC_Msk | NVM_NVMPROG_RSTVERR_Msk) | FLASH_CMD_PROG_BLOCK);
                    *lAddress = lContent[FIRST_ARRAY_ELEMENT];
                    lAddress++;
                    *lAddress = lContent[SECOND_ARRAY_ELEMENT];
                    lAddress++;
                    *lAddress = lContent[THIRD_ARRAY_ELEMENT];
                    lAddress++;
                    *lAddress = lContent[FOURTH_ARRAY_ELEMENT];
                    lAddress++;

