zhanzr/XMC1100-Boot-Kit-Demo/main.c
/* ========================================================================= */
/*lint -save -e961 MISRA Rule 19.7 accepted */
#define DO1(src, crc)    *crc = crc_table[((uint32_t) *crc ^ (*src++)) & BITMASK_FF] ^ (*crc >> 8U);
#define DO2(src, crc)    DO1(src, crc); DO1(src, crc);
#define DO4(src, crc)    DO2(src, crc); DO2(src, crc);

/*!
 * @brief     struct defining the FLASH content with CRC, size etc.
 * @attention this struct must be filled correctly with values before using in the Flash tests.
 * CRC32Val: this can be calculated by firmware (function ClassB_FLASHtest_POST) or external tools
 * Status  : set to valid to run the test
 */
#define ClassB_FLASH_CRC_REFERENCE { ClassB_Ref_ChkSum,         /* CRC32Val*/      \
                                     CRC_FLASHSIZE,             /* MemLength */    \
                                    (uint32_t)__STEXT,          /* StartAddress from linker */ \
                                    (uint32_t)__ETEXT,          /* End Address from linker  */  \
                                     FLASH_CRC_Valid }          /* Status */          

ClassB_StructFlashSignType const ClassB_Flash_CRC_REF __sectionClassB_CRCREF = ClassB_FLASH_CRC_REFERENCE;

static ClassB_EnumTestResultType ClassB_FLASHcrc32(uint32_t * crc32, uint32_t ** const pp_src, uint32_t len)
{
    uint8_t *                 src8;
    ClassB_EnumTestResultType result = ClassB_testFailed;

    /* check valid parameter */
    if ((len != 0) && (pp_src != 0) && (crc32 != Null))
    {
        result = ClassB_testPassed;
        /*lint -save -e826 -e927 -e928 MISRA Rule 11.4 cast from pointer to pointer accepted */
        /*lint -e961 MISRA Rule 12.13 accepted */
        src8   = (uint8_t *)(*pp_src);
        *crc32 = *crc32 ^ BITMASK_FFFFFFFF;
        if (len > FLASH_3BYTE_ALIGNED)
        {
            /* calculate the 4byte-aligned data */
            do
            {
                DO4(src8, crc32);
                len -= FLASH_4BYTE_ALIGNED;
            }while (len > FLASH_3BYTE_ALIGNED);
        }
        else
        {
            /** Do nothing */
        }

        /* calculate the non-4byte-aligned */
        while (0 != len)
        {
            DO1(src8, crc32);
            len--;
        }
        /*lint -e826 cast accepted */
        *pp_src = (uint32_t *)src8;
        *crc32 = *crc32 ^ BITMASK_FFFFFFFF;
        /*lint -restore */
    }
    else
    {
        /** Do nothing */
    }
    return(result);
}

ClassB_EnumTestResultType ClassB_FLASHTest_POST(void)
{
    ClassB_StructFlashSignType  TestCRC;
    ClassB_EnumTestResultType Result;

    /* preset the CRC initial value */
    TestCRC.CRC32Val     = 0U;
    TestCRC.StartAddress = ClassB_Flash_CRC_REF.StartAddress;
    TestCRC.EndAddress   = ClassB_Flash_CRC_REF.EndAddress;
    /* set MemLength to default */
    TestCRC.MemLength    = ClassB_Flash_CRC_REF.EndAddress - ClassB_Flash_CRC_REF.StartAddress;

    /* check the default memory size overwritten */
    if (0U != ClassB_Flash_CRC_REF.MemLength)
    {
         TestCRC.MemLength = ((uint32_t) (ClassB_Flash_CRC_REF.MemLength - (ClassB_Flash_CRC_REF.StartAddress-ClassB_FLASH_START)));
         /* check the boundaries of the Flash device */
         if (((uint32_t)(ClassB_Flash_CRC_REF.StartAddress + ClassB_Flash_CRC_REF.MemLength)) > ((uint32_t)(ClassB_FLASH_START + ClassB_FLASH_SIZE)))
         {
             /* limit the MemLength to the maximum value */
             TestCRC.MemLength = ((uint32_t) (ClassB_FLASH_SIZE - (ClassB_Flash_CRC_REF.StartAddress-ClassB_FLASH_START)));
         }
        else
        {
            /** Do nothing */
        }
    }
    else
    {
        /** Do nothing */
    }
    /*lint -save -e740 -e929 MISRA Rule 11.4 cast from pointer to pointer accepted */
    /* Do the POST signature generation according to the various flash sizes
     * check the complete Flash memory in relation to the flash size */
    Result = ClassB_FLASHcrc32(&TestCRC.CRC32Val, (uint32_t ** )&TestCRC.StartAddress, TestCRC.MemLength);
    /*lint -restore */
    TestCRC.Status = FLASH_CRC_Done;

    if (ClassB_testPassed == Result)
    {
        Result = ClassB_testFailed;
        /* check status flag and CRC value */
        if (ClassB_Flash_CRC_REF.Status == FLASH_CRC_Valid)
        {
            if (TestCRC.CRC32Val == ClassB_Flash_CRC_REF.CRC32Val)
//						if(true)
            {
                Result = ClassB_testPassed;
            }
            else
            {
                /** Do nothing */
            }
        }
        else
        {
            /** Do nothing */
        }
    }
    else
    {
        /** Do nothing */
    }
/* FLASH-Test failure insertion test */
#ifdef CLASSB_FAILURE_INJECTION_FLASH_TEST
    Result = ClassB_testFailed;
#endif

    return(Result);
}

extern void Reset_Handler(void);
//This test is destructive and will initialize the whole RAM to zero.
void MemtestFunc(void)
{
	//It seems not necessary to call this function as we only use the default clock setting
//	SystemInit();
	
  /*Initialize the UART driver */
	uart_tx.mode = XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT7;
	uart_rx.mode = XMC_GPIO_MODE_INPUT_TRISTATE;
 /* Configure UART channel */
  XMC_UART_CH_Init(XMC_UART0_CH1, &uart_config);
  XMC_UART_CH_SetInputSource(XMC_UART0_CH1, XMC_UART_CH_INPUT_RXD,USIC0_C1_DX0_P1_3);
	/* Start UART channel */
  XMC_UART_CH_Start(XMC_UART0_CH1);
  /* Configure pins */
	XMC_GPIO_Init(UART_TX, &uart_tx);
  XMC_GPIO_Init(UART_RX, &uart_rx);
	
	LED_Initialize();

	//Parity Test

	if (ClassB_testFailed == ClassB_RAMTest_Parity())
	{
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'R');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'P');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'F');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'L');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, '\n');			
		FailSafePOR();
	}
	else
	{				
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'R');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'P');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'O');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, 'K');
		XMC_UART_CH_Transmit(XMC_UART0_CH1, '\n');
	}

  /* test FLASH content */
	if (ClassB_testFailed == ClassB_FLASHTest_POST())
    {
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'F');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'R');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'F');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'L');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, '\n');		
			
			FailSafePOR();
    }
    else
    {
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'F');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'R');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'O');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, 'K');
			XMC_UART_CH_Transmit(XMC_UART0_CH1, '\n');
    }
		
 /* test ECC logic on FLASH */

